system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;


vertices
(
    ( -100.0  -50.0  0.0 ) // 0
	(  200.0  -50.0  0.0 ) // 1
	(  200.0   50.0  0.0 ) // 2
	( -100.0   50.0  0.0 ) // 3
	( -100.0  -50.0  200.0 )//4
	(  200.0  -50.0  200.0 )//5
	(  200.0   50.0  200.0 )//6
	( -100.0   50.0  200.0 )//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 100 150) simpleGrading (1 1 1)
);

edges
(
);


boundary
(
     allBoundary//Don't worry about these settings
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
